# Упаковка дубликатов 🌶️
# На вход программе подается строка текста, содержащая символы. Напишите программу, которая упаковывает последовательности одинаковых символов заданной строки в подсписки.

# Формат входных данных
# На вход программе подается строка текста, содержащая символы, отделенные символом пробела.

# Формат выходных данных
# Программа должна вывести указанный вложенный список.

# Тестовые данные 🟢
# Sample Input 1:

# a b c d
# Sample Output 1:

# [['a'], ['b'], ['c'], ['d']]
# Sample Input 2:

# w w w o r l d g g g g r e a t t e c c h e m g g p w w
# Sample Output 2:

# [['w', 'w', 'w'], ['o'], ['r'], ['l'], ['d'], ['g', 'g', 'g', 'g'], ['r'], ['e'], ['a'], ['t', 't'], ['e'], ['c', 'c'], ['h'], ['e'], ['m'], ['g', 'g'], ['p'], ['w', 'w']]
# Sample Input 3:

# g i v e t h h i i s m a a a n a g u u n
# Sample Output 3:

# [['g'], ['i'], ['v'], ['e'], ['t'], ['h', 'h'], ['i', 'i'], ['s'], ['m'], ['a', 'a', 'a'], ['n'], ['a'], ['g'], ['u', 'u'], [


txt = input().split()
l = [[txt[0]]]
for i in range(1, len(txt)):
  if txt[i] == txt[i - 1]:
    l[-1].append(txt[i])
  else:
    l.append([txt[i]])
print(l)