
# User avatar
# "Поколение Python": курс для продвинутых
# Прогресс по курсу:  1934/2083

  
# 1  Общая информация о курсе
  
  
  
# 2  Повторяем основные конструкции языка Python 🐍
  
  
  
# 3  Тип данных bool и NoneType
  
  
  
# 4  Вложенные списки
  
# 4.1  Повторяем списки
  
# 4.2  Вложенные списки. Часть 1
  
# 4.3  Вложенные списки. Часть 2
  
# 4.4  Матрицы. Часть 1
  
# 4.5  Матрицы. Часть 2
  
# 4.6  Матрицы. Часть 3
  
# 4.7  Операции над матрицами в математике
  
# Экзамен
# 5  Итоговая работа на вложенные списки и матрицы
  
# 5.1  Итоговая работа
  
# 6  Кортежи
  
# 6.1  Введение в кортежи
  
# 6.2  Основы работы с кортежами. Часть 1
  
# 6.3  Основы работы с кортежами. Часть 2
  
# 7  Итоговая работа на кортежи
  
# 7.1  Итоговая работа
  
# 8  Множества
  
# 8.1  Множества в математике
  
# 8.2  Операции над множествами, диаграммы Эйлера-Венна
  
# 8.3  Введение в множества в Python
  
# 8.4  Основы работы с множествами
  
# 8.5  Методы множеств. Часть 1
  
# 8.6  Методы множеств. Часть 2
  
# 8.7  Методы множеств. Часть 3
  
# 8.8  Генераторы множеств и frozenset
  
# Экзамен
# 9  Итоговая работа на множества
  
  
  
# 10  Словари
  
  
  
  
  
  
# Экзамен
# 11  Итоговая работа на словари
  
  
  
# 12  Модули random и string
  
  
  
  
# 13  Модули decimal, fraction и complex
  
  
  
  
# 14  🐢 Модуль turtle 🐢
  
  
  
  
# 15  Функции
  
  
  
  
  
  
  
  
  
  
# Экзамен
# 16  Итоговая работа на функции
  
  
  
  
# 17  Работа с файлами
  
  
  
  
  
# Экзамен
# 18  Итоговая работа на файлы
  
  
# 19  Заключение
  
  
# 8.4 Основы работы с множествами
# 16 из 16 шагов пройдено
# 50 из 50 баллов  получено
# Вы прошли больше 80% курса, оставьте отзыв
# Количество различных символов
# На вход программе подается строка текста. Напишите программу, которая определяет количество различных символов в строке.

# Формат входных данных
# На вход программе подается строка текста.

# Формат выходных данных
# Программа должна вывести количество различных символов в строке.

# Примечание. Задачу можно решить в одну строчку кода.

# Тестовые данные 🟢
# Sample Input 1:

# 12345678910
# Sample Output 1:

# 10
# Sample Input 2:

# ab bc
# Sample Output 2:

# 4


print(len(set(input())))




